Tee Junction/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    "(outlet.*)"
    {
        type            calculated;
        value           uniform 0;
    }

    owall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}



/* 
Fluent Default Roughness Settings

    wall
    {
        type    nutRoughWallFunction;
        Ks      0   ;               //Sand-grain roughness
        cS      0.5 ;               //roughness constant
    }

*/



// ************************************************************************* //
