Tee Junction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.001;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep          yes;

//maxCo          1;            only available in pimle
//maxDeltaT       0.001 ;


functions
{
    probes
    {
        type            probes;
        libs            (sampling);
    
        // Name of the directory for probe data
        name            probes;
    
        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   1;
    
        // Fields to be probed
        fields          (p U);
    
        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cellPoint;
    
        probeLocations
        (
            (0 0 0 )          // at inlet
            (0 0 -0.5)        // at ponit4
            (0.5 0 0) 
            (-0.5 0 0)
        );
    
    }

    #includeFunc Q              ;
    #includeFunc flowRatePatchInlet  ;
    #includeFunc flowRatePatchOone   ;
    #includeFunc flowRatePatchOtwo   ;
}


// ************************************************************************* //
