Tee Junction/system/flowRatePatchOtwo
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2106
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the flow rate through a specified patch by summing the flux on
    patch faces.  For solvers where the flux is volumetric, the flow rate is
    volumetric; where flux is mass flux, the flow rate is mass flow rate.

\*---------------------------------------------------------------------------*/

name    outlet2 ;
#includeEtc "caseDicts/postProcessing/flowRate/flowRatePatch.cfg"

// ************************************************************************* //
