Tee Junction/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
        minIter         10;
        //maxIter         100;
    }
    


    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0.0;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
        minIter         10 ;
        //maxIter         100     ;

    }


    "(k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-04;
        relTol          0;
    }
}

PISO
{
    nCorrectors     3 ;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       101325;
}

relaxationFactors
{
    equations
    {
        U   0.7;
        p   0.3;
    }
}
// ************************************************************************* //
